In [73]:
import pandas as pd
import json
import os

In [74]:
filename = 'purchase_data2.json'

with open(filename, 'r') as f:
        datastore = json.load(f)

In [75]:
player_df = pd.DataFrame(datastore, columns=['Age', 'Gender','Item ID','Item Name','Price','SN'])
player_df.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [76]:
#Total Number of Players
total_player = len(player_df)
print("Total Player: ", total_player)

Total Player:  78

In [77]:
# Purchasing Analysis Total

# Number of Unique Items
unique_item_count = player_df['Item ID'].value_counts().count()
unique_item_count

64

In [78]:
# Average Purchase Price
average_purchase_price = player_df['Price'].mean()
average_purchase_price

2.9243589743589733

In [79]:
# Total Number of Purchases
total_purchase = player_df['Price'].count()
total_purchase

78

In [80]:
# Total Revenue
total_revenue = player_df['Price'].sum()
total_revenue

228.0999999999999

In [81]:
print("Purchasing Analysis (Total)")
purchase_analysis_total_df = pd.DataFrame({"Number of Unique Items":[unique_item_count],
                            "Average Purchase Price":["${:.2f}".format(average_purchase_price)],
                            "Total Number of Purchases":[total_purchase],
                            "Total Revenue":["${:.2f}".format(total_revenue)]
                            
                     })
purchase_analysis_total_df

Purchasing Analysis (Total)

,Average Purchase Price,Number of Unique Items,Total Number of Purchases,Total Revenue
0,$2.92,64,78,$228.10

In [82]:
# Gender Demographics

# Percentage and Count of Male Players

number_male_players = player_df['Gender'].value_counts()['Male']
number_male_players

64

In [83]:
percent_male_players = number_male_players/total_player*100
percent_male_players

82.051282051282044

In [84]:
# Percentage and Count of Female Players
number_female_players = player_df['Gender'].value_counts()['Female']
number_female_players

13

In [85]:
percent_female_players = number_female_players/total_player*100
percent_female_players

16.666666666666664

In [86]:
# Percentage and Count of Other / Non-Disclosed

other_player = total_player - (number_male_players + number_female_players)
other_player

1

In [87]:
percent_other_players = other_player/total_player*100
percent_other_players

1.2820512820512819

In [88]:
genderdemograph={}

genderdemograph['Female']=[percent_female_players,number_female_players]
genderdemograph['Male']=[percent_male_players,number_male_players]
genderdemograph['Other/None-Disclosed']=[percent_other_players,other_player]

gender_demograph_df = pd.DataFrame(genderdemograph)
gender_demograph_new_df = gender_demograph_df.transpose()
gender_demograph_new_df.columns=['Percentage of Players', 'Total Count']
gender_demograph_new_df

                      Percentage of Players  Total Count
Female                            16.666667         13.0
Male                              82.051282         64.0
Other/None-Disclosed               1.282051          1.0

In [89]:
group_by_gender =player_df.groupby(['Gender'])
group_by_gender_df = group_by_gender['Price'].describe()

gender_group_df = group_by_gender_df.iloc[1,:]
gender_group_df

count    64.000000
mean      2.884375
std       1.133868
min       1.080000
25%       1.917500
50%       2.740000
75%       4.057500
max       4.810000
Name: Male, dtype: float64

In [90]:
# Purchasing Analysis (Gender)

# Male players

# Purchase Count and Average Purchase Price
male_purchase_count = gender_group_df['count']
average_male_purchase_price = gender_group_df['mean']
print(male_purchase_count)
print(average_male_purchase_price)

64.0
2.884375

In [91]:
# Total Purchase Value
total_male_purchase = player_df.loc[player_df['Gender']=='Male']['Price'].sum()
total_male_purchase

184.59999999999997

In [92]:
# Normalized Totals
normalized_male_total = total_male_purchase/gender_group_df['std']
normalized_male_total

162.80554040681091

In [93]:
# Female players

gender_group_df = group_by_gender_df.iloc[0,:]
gender_group_df

count    13.000000
mean      3.183077
std       1.174815
min       1.020000
25%       2.260000
50%       3.640000
75%       4.120000
max       4.710000
Name: Female, dtype: float64

In [94]:

# Purchase Count and Average Purchase Price
female_purchase_count = gender_group_df['count']
average_female_purchase_price = gender_group_df['mean']
print(female_purchase_count)
print(average_female_purchase_price)

13.0
3.18307692308

In [95]:
# Total Purchase Value
total_female_purchase = player_df.loc[player_df['Gender']=='Female']['Price'].sum()

total_female_purchase

41.38

In [96]:
# Normalized Totals
normalized_female_total = total_female_purchase/gender_group_df['std']
normalized_female_total

35.222573855880349

In [97]:
# Other None-Disclosed Players
other_group_df = group_by_gender_df.iloc[2,:]
other_group_df

count    1.00
mean     2.12
std       NaN
min      2.12
25%      2.12
50%      2.12
75%      2.12
max      2.12
Name: Other / Non-Disclosed, dtype: float64

In [98]:
# Purchase Count and Average Purchase Price
other_purchase_count = other_group_df['count']
average_other_purchase_price = other_group_df['mean']
print(other_purchase_count)
print(average_other_purchase_price)

1.0
2.12

In [99]:
#Total purchase
total_other_purchase = player_df.loc[player_df['Gender']=='Other / Non-Disclosed']['Price'].sum()
total_other_purchase

2.12

In [100]:
# Normalized Total
normalized_other_total = total_other_purchase/other_group_df['std']
normalized_other_total

nan

In [101]:
purchase_gender={}

purchase_gender['Female']=[female_purchase_count,average_female_purchase_price,total_female_purchase,normalized_female_total]
purchase_gender['Male']=[male_purchase_count,average_male_purchase_price,total_male_purchase,normalized_male_total]
purchase_gender['Other/None-Disclosed']=[other_purchase_count,average_other_purchase_price,total_other_purchase,normalized_other_total]

purchase_gender_df = pd.DataFrame(purchase_gender)
purchase_gender_df = purchase_gender_df.transpose()
purchase_gender_df.columns=['Purchase Count', 'Purchase Count','Total Purchase Value','Normalized Totals']
purchase_gender_df

,Purchase Count,Purchase Count,Total Purchase Value,Normalized Totals
Female,13.0,3.183077,41.38,35.222574
Male,64.0,2.884375,184.60,162.805540
Other/None-Disclosed,1.0,2.120000,2.12,NaN

In [102]:
#  Age Demographics

# age groups are broken into bins of 4 years 

max_age = player_df['Age'].max()
min_age = player_df['Age'].min()

print(max_age)
print(min_age)

40
7

bins = [5, 9.5, 14.5,19.5,24.5,29,5,34.5,39.5,44.5]
group_labels = ['<10', '10-14', '15-19','20-24','25-29','30-34','35-39','40-44']

player_df['Age Group'] = pd.cut(player_df['Age'],bins,labels=group_labels)

#by_age_group1 = player_df.sort_values(["Age Group"])
by_age_group1=player_df.groupby(['Age Group'])
by_age_group1.describe()

In [146]:
bins = [5, 9.5, 14.5,19.5,24.5,29.5,34.5,39.5,44.5] 
group_labels = ["<10", "10-14", "15-19","20-24","25-29","30-34","35-39","40-44"]
player_df['Age Group'] = pd.cut(player_df['Age'],bins,labels=group_labels)
#by_age_group1 = player_df.sort_values(["Age Group"])
by_age_group1=player_df.groupby(['Age Group']) 
by_age_group_describe = by_age_group1.describe()

In [149]:
by_age_group_df = by_age_group_describe['Price']
by_age_group_df= by_age_group_df.iloc[:,[0,1,2]]
by_age_group_df['Total Purchase Value'] = by_age_group_df['count']*by_age_group_df['mean']
by_age_group_df['Normalized Totals']=by_age_group_df['Total Purchase Value']/by_age_group_df['std']
by_age_group_df=by_age_group_df.rename(columns={'count':'Purchase Count','mean':'Average Purchase Price'})
by_age_group_df_summary=by_age_group_df.drop(['std'],axis=1)
by_age_group_df_summary['Average Purchase Price']=by_age_group_df_summary['Average Purchase Price'].map("{:.2f}".format)
by_age_group_df_summary['Normalized Totals']=by_age_group_df_summary['Normalized Totals'].map("{:.2f}".format)
by_age_group_df_summary.reset_index()

,Age Group,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
0,<10,5.0,2.76,13.82,8.766470
1,10-14,3.0,2.99,8.96,10.358324
2,15-19,11.0,2.76,30.41,31.935468
3,20-24,36.0,3.02,108.89,98.698281
4,25-29,9.0,2.90,26.11,19.545794
5,30-34,7.0,1.98,13.89,17.901180
6,35-39,6.0,3.56,21.37,19.851675
7,40-44,1.0,4.65,4.65,NaN

In [104]:
# Top Spenders

player_group_by_SN_df = player_df.groupby(['SN'],as_index=False)['Price'].sum()
player_group_by_SN_df_2=player_df.groupby(['SN'],as_index=False)['Item ID'].count()

group_by_SN_df = pd.merge(player_group_by_SN_df,player_group_by_SN_df_2, on='SN')
group_by_SN_df
player_top_5_spender = group_by_SN_df.sort_values(['Price'], ascending=False).head(5)
player_top_5_spender

            SN  Price  Item ID
63   Sundaky74   7.41        2
4    Aidaira26   5.13        2
23     Eusty71   4.81        1
16  Chanirra64   4.78        1
8     Alarap40   4.71        1

In [105]:
player_top_5_spender['Average Purchase Price']=player_top_5_spender['Price']/player_top_5_spender['Item ID']
player_top_5_spender.rename(columns={'Price':'Total Purchase Value','Item_ID':'Purchase Count'})
print("Top 5 Spenders")
player_top_5_spender

Top 5 Spenders

            SN  Price  Item ID  Average Purchase Price
63   Sundaky74   7.41        2                   3.705
4    Aidaira26   5.13        2                   2.565
23     Eusty71   4.81        1                   4.810
16  Chanirra64   4.78        1                   4.780
8     Alarap40   4.71        1                   4.710

In [106]:
# Most Popular Items

by_item_df1=player_df.iloc[:,[2,3,4]]


by_item_df= pd.DataFrame(by_item_df1['Item ID'].value_counts())
by_item_df = by_item_df.reset_index()
by_item_df = by_item_df.rename(columns={'index':'Item ID','Item ID':'Purchase Count'})

top_5_by_purchase_count=pd.merge(by_item_df,by_item_df1, on=('Item ID'))
top_5_by_purchase_count['Total Purchase Value']=top_5_by_purchase_count['Purchase Count']*top_5_by_purchase_count['Price']
by_item_df.rename(columns={'Price':'Item Price'})
top_5_by_purchase_summary = top_5_by_purchase_count.drop_duplicates(['Item ID'])

print('5 Most Popular Items by purchase count')

top_5_by_purchase_summary.head(5)

5 Most Popular Items by purchase count

,Item ID,Purchase Count,Item Name,Price,Total Purchase Value
0,94,3,Mourning Blade,3.64,10.92
3,98,2,"Deadline, Voice Of Subtlety",1.29,2.58
5,93,2,Apocalyptic Battlescythe,4.49,8.98
7,64,2,Fusion Pummel,2.42,4.84
9,60,2,Wolf,2.70,5.40

In [107]:
# Most Profitable Items

print("5 Most Profitable Items by Total Purchase Value")
most_profitable_item = top_5_by_purchase_summary.sort_values(['Total Purchase Value'], ascending=False).head(5)
most_profitable_item['Purchase Count'] =most_profitable_item['Purchase Count'].astype(int)
most_profitable_item.rename(columns={'Price':'Item Price'})

most_profitable_item

5 Most Profitable Items by Total Purchase Value

,Item ID,Purchase Count,Item Name,Price,Total Purchase Value
0,94,3,Mourning Blade,3.64,10.92
11,117,2,"Heartstriker, Legacy of the Light",4.71,9.42
5,93,2,Apocalyptic Battlescythe,4.49,8.98
23,90,2,Betrayer,4.12,8.24
17,154,2,Feral Katana,4.11,8.22